{
  "Projects": [
    {
      "show": true,
      "title": "Marriage Hall Venue Management",
      "desc": [
        "Designed and developed a fully interactive, responsive website for a marriage hall, ensuring smooth navigation and an intuitive user experience across devices. Created a flexible backend with complete CRUD functionality, allowing the client to easily manage events, galleries, services, and bookings without technical support.",
        "Integrated a dynamic theme switcher to enhance UI personalization, giving users the ability to toggle between different looks and styles. Implemented responsive design principles, ensuring the website adapts seamlessly to desktops, tablets, and mobile devices.",
        "Prioritized clean code, maintainability, and modular design to support easy future updates and feature enhancements."
      ],
      "year": "2024",
      "preview": "https://mweb.kevinrahul.me",
      "code": "",
      "thumbnail": "/mWeb/home.png",
      "images": [
        "/mWeb/home.png",
        "/mWeb/book-dark.png",
        "/mWeb/book.png",
        "/mWeb/cont.png",
        "/mWeb/faq.png",
        "/mWeb/fasi.png",
        "/mWeb/gall.png",
        "/mWeb/home.png",
        "/mWeb/login.png",
        "/mWeb/test.png"
      ],
      "tech": [
        "NextJS",
        "Typescript",
        "Shadcn UI",
        "Tailwind CSS",
        "Drizzle",
        "Postgress",
        "Supabase",
        "Vercel"
      ], 
      "slug": "marriageHall",
      "category": [1]
    },
    {
      "show": true,
      "title": "Personal Protfolio Website",
      "desc": [
        "Designed and developed a fully responsive personal portfolio website using Next.js and Tailwind CSS to showcase skills, projects, and contact information in a professional and interactive manner. Implemented dynamic theme options (light/dark mode) to enhance user personalization and improve visual accessibility.",
        "Focused on responsive design principles to ensure seamless viewing across desktops, tablets, and mobile devices. Integrated modular components for maintainable code structure, allowing easy updates and future scalability.",
        "Designed with a modern, clean UI/UX to effectively highlight professional achievements and technical skills."
      ],
      "year": "2025",
      "preview": "https://www.kevinrahul.me",
      "code": "",
      "thumbnail": "/image/projects/web/apii-portfolio/porto-thumbnail.jpg",
      "images": [
        "/image/projects/web/apii-portfolio/porto1.png",
        "/image/projects/web/apii-portfolio/porto2.png",
        "/image/projects/web/apii-portfolio/porto3.png"
      ],
      "tech": [
        "NextJS",
        "Typescript",
        "Shadcn UI",
        "Tailwind CSS",
        "Vercel"
      ], 
      "slug": "apii-porto",
      "category": [1]
    },
    {
      "show": true,
      "title": "Chatbot Frontend",
      "desc": [
        "Designed and developed a fully responsive front-end interface for an AI chatbot, ensuring seamless interaction and a user-friendly experience across devices. Implemented dynamic theme options, allowing users to customize the interface and switch between light and dark modes for a modern, adaptive UI.",
        "Focused on clean, modular, and maintainable code using Next.js and TypeScript to enable smooth integration with backend APIs. Leveraged Tailwind CSS to create a visually appealing, consistent design with intuitive layouts, responsive components, and interactive elements."
      ],
      "year": "2025",
      "preview": "https://bot.kevinrahul.me",
      "code": "",
      "thumbnail": "/bot-front/home.png",
      "images": [
        "/bot-front/home.png",
        "/bot-front/home2.png",
        "/bot-front/feed.png",
        "/bot-front/feed2.png"
      ],
      "tech": [
        "NextJS",
        "Typescript",
        "Shadcn UI",
        "Tailwind CSS",
        "Vercel"
      ], 
      "slug": "chatbot",
      "category": [1]
    },
    {
      "show": true,
      "title": "AI-Powered Expense Tracker",
      "desc": [
        "Developed a full-stack AI-powered expense tracker that acts as a personal finance assistant, helping users track expenses and gain insights through natural language prompts. Integrated the Gemini API with SQL-based Retrieval-Augmented Generation (SQL-RAG) to provide intelligent, contextual responses based on PostgreSQL data.",
        "Implemented secure JWT-based authentication to manage user accounts and protect sensitive financial data. Built a responsive and interactive front-end using Next.js and TypeScript, delivering a seamless user experience across devices. Dockerized the entire application stack, ensuring easy deployment and consistency across environments.",
        "Deployed the backend on Render and the frontend on Vercel, enabling scalable and reliable cloud hosting. Focused on performance optimization, maintainable code structure, and modular design to support future enhancements."
      ],
      "year": "2025",
      "preview": "https://expense.kevinrahul.me",
      "code": "https://github.com/Alvalens/web-javanese-translation",
      "thumbnail": "/expense/home.png",
      "images": [
        "/expense/home.png",
        "/expense/home2.png",
        "/expense/signup.png",
        "/expense/login.png",
        "/expense/test.png",
        "/expense/test2.png"
      ],
      "tech": [
        "NextJS",
        "Typescript",
        "Shadcn UI",
        "Tailwind CSS",
        "Drizzle",
        "Postgress",
        "Gemini-Api",
        "Vercel",
        "JQuery",
        "JWT",
        "Python",
        "Flask",
        "Render",
        "Docker"
      ], 
      "slug": "expense-tracker",
      "category": [1]
    },
    {
      "show": true,
      "title": "Game Discovery Website",
      "desc": [
        "Developed an interactive Game Discovery Page using React, enabling users to explore and discover games seamlessly. Integrated search functionality, genre-based filtering, and platform selection using the RAWG API to provide a personalized browsing experience.",
        "Designed a responsive and adaptive UI with dark/light mode support, enhancing usability and visual appeal across devices. Optimized API calls and implemented efficient state management to improve performance, reduce load times, and ensure smooth interactions.",
        "Focused on clean, maintainable code and modular components for easier future updates and scalability."
      ],
      "year": "2024",
      "preview": "https://game.kevinrahul.me",
      "code": "https://github.com/Alvalens/heart-attack-prediction",
      "thumbnail": "/game/home.png",
      "images": [
        "/game/home.png",
        "/game/home2.png",
        "/game/search.png",
        "/game/test.png",
        "/game/test2.png"
      ],
      "tech": [
        "ReactJS",
        "Typescript",
        "Shadcn UI",
        "Tailwind CSS",
        "RAWG API",
        "Vercel"
      ], 
      "slug": "game-discovery",
      "category": [1]
    },
    {
      "show": true,
      "title": "RealTime GPS-Tracking",
      "desc": [
        "Developed a real-time GPS tracking web application using Django, enabling live location updates for users. Integrated RabbitMQ and MQTT protocols to ensure fast, reliable, and efficient data transfer between devices and the server.",
        "Optimized database queries and server responses to improve application speed and overall performance. Deployed the application on Railway, ensuring strong uptime, scalability, and smooth real-time tracking experience.",
        "Focused on maintainable, modular code architecture to support future feature expansions and enhancements."
      ],
      "year": "2023",
      "preview": "",
      "code": "https://github.com/Alvalens/generative-trivia",
      "thumbnail": "/image/projects/web/trivia/trivia-thumbnail.png",
      "images": [
        "/image/projects/web/trivia/trivia1.png",
        "/image/projects/web/trivia/trivia2.png",
        "/image/projects/web/trivia/trivia3.png"
      ],
      "tech": [
        "Python",
        "Django",
        "CSS",
        "HTML",
        "Postgress",
        "Railway",
        "MQTT"
      ], 
      "slug": "gps-tracking",
      "category": [1]
    }
  ]
}
